{"keras_version": "1.2.0", "config": [{"config": {"border_mode": "valid", "dim_ordering": "tf", "nb_filter": 32, "b_constraint": null, "trainable": true, "subsample": [1, 1], "name": "convolution2d_1", "b_regularizer": null, "init": "glorot_uniform", "activity_regularizer": null, "batch_input_shape": [null, 64, 64, 3], "activation": "linear", "bias": true, "input_dtype": "float32", "W_constraint": null, "nb_col": 3, "nb_row": 3, "W_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"border_mode": "valid", "dim_ordering": "tf", "trainable": true, "name": "averagepooling2d_1", "pool_size": [2, 2], "strides": [2, 2]}, "class_name": "AveragePooling2D"}, {"config": {"name": "activation_1", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"border_mode": "valid", "dim_ordering": "tf", "nb_filter": 32, "b_constraint": null, "trainable": true, "subsample": [1, 1], "name": "convolution2d_2", "b_regularizer": null, "init": "glorot_uniform", "activity_regularizer": null, "batch_input_shape": [null, 32, 32, 3], "activation": "linear", "bias": true, "input_dtype": "float32", "W_constraint": null, "nb_col": 3, "nb_row": 3, "W_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"border_mode": "valid", "dim_ordering": "tf", "trainable": true, "name": "averagepooling2d_2", "pool_size": [2, 2], "strides": [2, 2]}, "class_name": "AveragePooling2D"}, {"config": {"name": "activation_2", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"name": "flatten_1", "batch_input_shape": [null, 8, 8, 16], "trainable": true, "input_dtype": "float32"}, "class_name": "Flatten"}, {"config": {"input_dim": 6272, "trainable": true, "name": "dense_1", "init": "glorot_uniform", "bias": true, "b_regularizer": null, "output_dim": 128, "activity_regularizer": null, "activation": "linear", "W_constraint": null, "b_constraint": null, "W_regularizer": null}, "class_name": "Dense"}, {"config": {"name": "activation_3", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"input_dim": 128, "trainable": true, "name": "dense_2", "init": "glorot_uniform", "bias": true, "b_regularizer": null, "output_dim": 64, "activity_regularizer": null, "activation": "linear", "W_constraint": null, "b_constraint": null, "W_regularizer": null}, "class_name": "Dense"}, {"config": {"name": "activation_4", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"input_dim": 64, "trainable": true, "name": "dense_3", "init": "glorot_uniform", "bias": true, "b_regularizer": null, "output_dim": 1, "activity_regularizer": null, "activation": "linear", "W_constraint": null, "b_constraint": null, "W_regularizer": null}, "class_name": "Dense"}, {"config": {"name": "activation_5", "trainable": true, "activation": "linear"}, "class_name": "Activation"}], "class_name": "Sequential"}