{"keras_version": "1.2.1", "config": [{"config": {"input_dtype": "float32", "trainable": true, "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e9\u007f\u0000\u0000\u0000\u00e9\u0001\u0000\u0000\u0000\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\bmodel.py\u00da\b<lambda>\u0011\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "name": "lambda_1", "arguments": {}, "batch_input_shape": [null, 66, 200, 3]}, "class_name": "Lambda"}, {"config": {"trainable": true, "W_constraint": null, "b_regularizer": null, "border_mode": "valid", "W_regularizer": null, "name": "convolution2d_1", "activation": "linear", "bias": true, "nb_col": 5, "dim_ordering": "tf", "activity_regularizer": null, "init": "normal", "subsample": [2, 2], "b_constraint": null, "nb_row": 5, "nb_filter": 24}, "class_name": "Convolution2D"}, {"config": {"name": "activation_1", "trainable": true, "activation": "elu"}, "class_name": "Activation"}, {"config": {"name": "dropout_1", "trainable": true, "p": 0.5}, "class_name": "Dropout"}, {"config": {"trainable": true, "W_constraint": null, "b_regularizer": null, "border_mode": "valid", "W_regularizer": null, "name": "convolution2d_2", "activation": "linear", "bias": true, "nb_col": 5, "dim_ordering": "tf", "activity_regularizer": null, "init": "normal", "subsample": [2, 2], "b_constraint": null, "nb_row": 5, "nb_filter": 36}, "class_name": "Convolution2D"}, {"config": {"name": "activation_2", "trainable": true, "activation": "elu"}, "class_name": "Activation"}, {"config": {"name": "dropout_2", "trainable": true, "p": 0.5}, "class_name": "Dropout"}, {"config": {"trainable": true, "W_constraint": null, "b_regularizer": null, "border_mode": "valid", "W_regularizer": null, "name": "convolution2d_3", "activation": "linear", "bias": true, "nb_col": 5, "dim_ordering": "tf", "activity_regularizer": null, "init": "normal", "subsample": [2, 2], "b_constraint": null, "nb_row": 5, "nb_filter": 48}, "class_name": "Convolution2D"}, {"config": {"name": "activation_3", "trainable": true, "activation": "elu"}, "class_name": "Activation"}, {"config": {"name": "dropout_3", "trainable": true, "p": 0.5}, "class_name": "Dropout"}, {"config": {"trainable": true, "W_constraint": null, "b_regularizer": null, "border_mode": "valid", "W_regularizer": null, "name": "convolution2d_4", "activation": "linear", "bias": true, "nb_col": 3, "dim_ordering": "tf", "activity_regularizer": null, "init": "normal", "subsample": [1, 1], "b_constraint": null, "nb_row": 3, "nb_filter": 64}, "class_name": "Convolution2D"}, {"config": {"name": "activation_4", "trainable": true, "activation": "elu"}, "class_name": "Activation"}, {"config": {"name": "dropout_4", "trainable": true, "p": 0.5}, "class_name": "Dropout"}, {"config": {"trainable": true, "W_constraint": null, "b_regularizer": null, "border_mode": "valid", "W_regularizer": null, "name": "convolution2d_5", "activation": "linear", "bias": true, "nb_col": 3, "dim_ordering": "tf", "activity_regularizer": null, "init": "normal", "subsample": [1, 1], "b_constraint": null, "nb_row": 3, "nb_filter": 64}, "class_name": "Convolution2D"}, {"config": {"name": "activation_5", "trainable": true, "activation": "elu"}, "class_name": "Activation"}, {"config": {"name": "dropout_5", "trainable": true, "p": 0.5}, "class_name": "Dropout"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"trainable": true, "W_constraint": null, "input_dim": 1152, "b_regularizer": null, "output_dim": 1164, "W_regularizer": null, "init": "glorot_uniform", "activation": "linear", "bias": true, "activity_regularizer": null, "name": "dense_1", "b_constraint": null}, "class_name": "Dense"}, {"config": {"name": "activation_6", "trainable": true, "activation": "elu"}, "class_name": "Activation"}, {"config": {"name": "dropout_6", "trainable": true, "p": 0.5}, "class_name": "Dropout"}, {"config": {"trainable": true, "W_constraint": null, "input_dim": 1164, "b_regularizer": null, "output_dim": 100, "W_regularizer": null, "init": "glorot_uniform", "activation": "linear", "bias": true, "activity_regularizer": null, "name": "dense_2", "b_constraint": null}, "class_name": "Dense"}, {"config": {"name": "activation_7", "trainable": true, "activation": "elu"}, "class_name": "Activation"}, {"config": {"name": "dropout_7", "trainable": true, "p": 0.5}, "class_name": "Dropout"}, {"config": {"trainable": true, "W_constraint": null, "input_dim": 100, "b_regularizer": null, "output_dim": 50, "W_regularizer": null, "init": "glorot_uniform", "activation": "linear", "bias": true, "activity_regularizer": null, "name": "dense_3", "b_constraint": null}, "class_name": "Dense"}, {"config": {"name": "activation_8", "trainable": true, "activation": "elu"}, "class_name": "Activation"}, {"config": {"name": "dropout_8", "trainable": true, "p": 0.5}, "class_name": "Dropout"}, {"config": {"trainable": true, "W_constraint": null, "input_dim": 50, "b_regularizer": null, "output_dim": 10, "W_regularizer": null, "init": "glorot_uniform", "activation": "linear", "bias": true, "activity_regularizer": null, "name": "dense_4", "b_constraint": null}, "class_name": "Dense"}, {"config": {"name": "activation_9", "trainable": true, "activation": "elu"}, "class_name": "Activation"}, {"config": {"trainable": true, "W_constraint": null, "input_dim": 10, "b_regularizer": null, "output_dim": 1, "W_regularizer": null, "init": "glorot_uniform", "activation": "linear", "bias": true, "activity_regularizer": null, "name": "dense_5", "b_constraint": null}, "class_name": "Dense"}, {"config": {"name": "activation_10", "trainable": true, "activation": "linear"}, "class_name": "Activation"}], "class_name": "Sequential"}