{"config": [{"config": {"border_mode": "valid", "init": "glorot_uniform", "nb_col": 3, "activation": "linear", "bias": true, "trainable": true, "activity_regularizer": null, "W_regularizer": null, "dim_ordering": "tf", "subsample": [1, 1], "name": "convolution2d_1", "nb_row": 3, "batch_input_shape": [null, 32, 32, 3], "b_regularizer": null, "b_constraint": null, "nb_filter": 32, "W_constraint": null, "input_dtype": "float32"}, "class_name": "Convolution2D"}, {"config": {"border_mode": "valid", "name": "maxpooling2d_1", "dim_ordering": "tf", "trainable": true, "strides": [2, 2], "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "name": "activation_1", "activation": "relu"}, "class_name": "Activation"}, {"config": {"trainable": true, "name": "dropout_1", "p": 0.5}, "class_name": "Dropout"}, {"config": {"trainable": true, "name": "flatten_1", "batch_input_shape": [null, 8, 8, 16], "input_dtype": "float32"}, "class_name": "Flatten"}, {"config": {"init": "glorot_uniform", "activation": "linear", "bias": true, "trainable": true, "W_regularizer": null, "input_dim": 7200, "name": "dense_1", "b_regularizer": null, "b_constraint": null, "activity_regularizer": null, "output_dim": 128, "W_constraint": null}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "activation_2", "activation": "relu"}, "class_name": "Activation"}, {"config": {"init": "glorot_uniform", "activation": "linear", "bias": true, "trainable": true, "W_regularizer": null, "input_dim": 128, "name": "dense_2", "b_regularizer": null, "b_constraint": null, "activity_regularizer": null, "output_dim": 1, "W_constraint": null}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "activation_3", "activation": "linear"}, "class_name": "Activation"}], "keras_version": "1.2.0", "class_name": "Sequential"}