{"class_name": "Sequential", "config": [{"class_name": "Lambda", "config": {"function_type": "lambda", "name": "lambda_1", "batch_input_shape": [null, 66, 200, 3], "output_shape_type": "raw", "trainable": true, "arguments": {}, "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e9\u007f\u0000\u0000\u0000\u00e9\u0001\u0000\u0000\u0000\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\bmodel.py\u00da\b<lambda>\u0011\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "output_shape": null, "input_dtype": "float32"}}, {"class_name": "Convolution2D", "config": {"init": "normal", "activity_regularizer": null, "nb_filter": 24, "W_constraint": null, "activation": "linear", "nb_col": 5, "subsample": [2, 2], "W_regularizer": null, "trainable": true, "bias": true, "nb_row": 5, "dim_ordering": "tf", "name": "convolution2d_1", "b_regularizer": null, "border_mode": "valid", "b_constraint": null}}, {"class_name": "Activation", "config": {"name": "activation_1", "trainable": true, "activation": "elu"}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "p": 0.5}}, {"class_name": "Convolution2D", "config": {"init": "normal", "activity_regularizer": null, "nb_filter": 36, "W_constraint": null, "activation": "linear", "nb_col": 5, "subsample": [2, 2], "W_regularizer": null, "trainable": true, "bias": true, "nb_row": 5, "dim_ordering": "tf", "name": "convolution2d_2", "b_regularizer": null, "border_mode": "valid", "b_constraint": null}}, {"class_name": "Activation", "config": {"name": "activation_2", "trainable": true, "activation": "elu"}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "trainable": true, "p": 0.5}}, {"class_name": "Convolution2D", "config": {"init": "normal", "activity_regularizer": null, "nb_filter": 48, "W_constraint": null, "activation": "linear", "nb_col": 5, "subsample": [2, 2], "W_regularizer": null, "trainable": true, "bias": true, "nb_row": 5, "dim_ordering": "tf", "name": "convolution2d_3", "b_regularizer": null, "border_mode": "valid", "b_constraint": null}}, {"class_name": "Activation", "config": {"name": "activation_3", "trainable": true, "activation": "elu"}}, {"class_name": "Dropout", "config": {"name": "dropout_3", "trainable": true, "p": 0.5}}, {"class_name": "Convolution2D", "config": {"init": "normal", "activity_regularizer": null, "nb_filter": 64, "W_constraint": null, "activation": "linear", "nb_col": 3, "subsample": [1, 1], "W_regularizer": null, "trainable": true, "bias": true, "nb_row": 3, "dim_ordering": "tf", "name": "convolution2d_4", "b_regularizer": null, "border_mode": "valid", "b_constraint": null}}, {"class_name": "Activation", "config": {"name": "activation_4", "trainable": true, "activation": "elu"}}, {"class_name": "Dropout", "config": {"name": "dropout_4", "trainable": true, "p": 0.5}}, {"class_name": "Convolution2D", "config": {"init": "normal", "activity_regularizer": null, "nb_filter": 64, "W_constraint": null, "activation": "linear", "nb_col": 3, "subsample": [1, 1], "W_regularizer": null, "trainable": true, "bias": true, "nb_row": 3, "dim_ordering": "tf", "name": "convolution2d_5", "b_regularizer": null, "border_mode": "valid", "b_constraint": null}}, {"class_name": "Activation", "config": {"name": "activation_5", "trainable": true, "activation": "elu"}}, {"class_name": "Dropout", "config": {"name": "dropout_5", "trainable": true, "p": 0.5}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"init": "glorot_uniform", "activity_regularizer": null, "W_constraint": null, "b_regularizer": null, "input_dim": 1152, "activation": "linear", "W_regularizer": null, "output_dim": 1164, "bias": true, "name": "dense_1", "trainable": true, "b_constraint": null}}, {"class_name": "Activation", "config": {"name": "activation_6", "trainable": true, "activation": "elu"}}, {"class_name": "Dropout", "config": {"name": "dropout_6", "trainable": true, "p": 0.5}}, {"class_name": "Dense", "config": {"init": "glorot_uniform", "activity_regularizer": null, "W_constraint": null, "b_regularizer": null, "input_dim": 1164, "activation": "linear", "W_regularizer": null, "output_dim": 100, "bias": true, "name": "dense_2", "trainable": true, "b_constraint": null}}, {"class_name": "Activation", "config": {"name": "activation_7", "trainable": true, "activation": "elu"}}, {"class_name": "Dropout", "config": {"name": "dropout_7", "trainable": true, "p": 0.5}}, {"class_name": "Dense", "config": {"init": "glorot_uniform", "activity_regularizer": null, "W_constraint": null, "b_regularizer": null, "input_dim": 100, "activation": "linear", "W_regularizer": null, "output_dim": 50, "bias": true, "name": "dense_3", "trainable": true, "b_constraint": null}}, {"class_name": "Activation", "config": {"name": "activation_8", "trainable": true, "activation": "elu"}}, {"class_name": "Dropout", "config": {"name": "dropout_8", "trainable": true, "p": 0.5}}, {"class_name": "Dense", "config": {"init": "glorot_uniform", "activity_regularizer": null, "W_constraint": null, "b_regularizer": null, "input_dim": 50, "activation": "linear", "W_regularizer": null, "output_dim": 10, "bias": true, "name": "dense_4", "trainable": true, "b_constraint": null}}, {"class_name": "Activation", "config": {"name": "activation_9", "trainable": true, "activation": "elu"}}, {"class_name": "Dense", "config": {"init": "glorot_uniform", "activity_regularizer": null, "W_constraint": null, "b_regularizer": null, "input_dim": 10, "activation": "linear", "W_regularizer": null, "output_dim": 1, "bias": true, "name": "dense_5", "trainable": true, "b_constraint": null}}, {"class_name": "Activation", "config": {"name": "activation_10", "trainable": true, "activation": "linear"}}], "keras_version": "1.2.1"}