{"config": [{"config": {"batch_input_shape": [null, 66, 200, 3], "trainable": true, "output_shape": null, "name": "lambda_1", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e9\u007f\u0000\u0000\u0000\u00e9\u0001\u0000\u0000\u0000\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\bmodel.py\u00da\b<lambda>\u0011\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "arguments": {}, "output_shape_type": "raw", "input_dtype": "float32", "function_type": "lambda"}, "class_name": "Lambda"}, {"config": {"border_mode": "valid", "activation": "linear", "nb_row": 5, "dim_ordering": "tf", "W_constraint": null, "W_regularizer": null, "bias": true, "nb_filter": 24, "name": "convolution2d_1", "subsample": [2, 2], "trainable": true, "init": "normal", "activity_regularizer": null, "b_constraint": null, "nb_col": 5, "b_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"activation": "elu", "trainable": true, "name": "activation_1"}, "class_name": "Activation"}, {"config": {"trainable": true, "p": 0.5, "name": "dropout_1"}, "class_name": "Dropout"}, {"config": {"border_mode": "valid", "activation": "linear", "nb_row": 5, "dim_ordering": "tf", "W_constraint": null, "W_regularizer": null, "bias": true, "nb_filter": 36, "name": "convolution2d_2", "subsample": [2, 2], "trainable": true, "init": "normal", "activity_regularizer": null, "b_constraint": null, "nb_col": 5, "b_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"activation": "elu", "trainable": true, "name": "activation_2"}, "class_name": "Activation"}, {"config": {"trainable": true, "p": 0.5, "name": "dropout_2"}, "class_name": "Dropout"}, {"config": {"border_mode": "valid", "activation": "linear", "nb_row": 5, "dim_ordering": "tf", "W_constraint": null, "W_regularizer": null, "bias": true, "nb_filter": 48, "name": "convolution2d_3", "subsample": [2, 2], "trainable": true, "init": "normal", "activity_regularizer": null, "b_constraint": null, "nb_col": 5, "b_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"activation": "elu", "trainable": true, "name": "activation_3"}, "class_name": "Activation"}, {"config": {"trainable": true, "p": 0.5, "name": "dropout_3"}, "class_name": "Dropout"}, {"config": {"border_mode": "valid", "activation": "linear", "nb_row": 3, "dim_ordering": "tf", "W_constraint": null, "W_regularizer": null, "bias": true, "nb_filter": 64, "name": "convolution2d_4", "subsample": [1, 1], "trainable": true, "init": "normal", "activity_regularizer": null, "b_constraint": null, "nb_col": 3, "b_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"activation": "elu", "trainable": true, "name": "activation_4"}, "class_name": "Activation"}, {"config": {"trainable": true, "p": 0.5, "name": "dropout_4"}, "class_name": "Dropout"}, {"config": {"border_mode": "valid", "activation": "linear", "nb_row": 3, "dim_ordering": "tf", "W_constraint": null, "W_regularizer": null, "bias": true, "nb_filter": 64, "name": "convolution2d_5", "subsample": [1, 1], "trainable": true, "init": "normal", "activity_regularizer": null, "b_constraint": null, "nb_col": 3, "b_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"activation": "elu", "trainable": true, "name": "activation_5"}, "class_name": "Activation"}, {"config": {"trainable": true, "p": 0.5, "name": "dropout_5"}, "class_name": "Dropout"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"activation": "linear", "W_constraint": null, "W_regularizer": null, "bias": true, "name": "dense_1", "b_constraint": null, "trainable": true, "b_regularizer": null, "init": "glorot_uniform", "activity_regularizer": null, "output_dim": 1164, "input_dim": 1152}, "class_name": "Dense"}, {"config": {"activation": "elu", "trainable": true, "name": "activation_6"}, "class_name": "Activation"}, {"config": {"trainable": true, "p": 0.5, "name": "dropout_6"}, "class_name": "Dropout"}, {"config": {"activation": "linear", "W_constraint": null, "W_regularizer": null, "bias": true, "name": "dense_2", "b_constraint": null, "trainable": true, "b_regularizer": null, "init": "glorot_uniform", "activity_regularizer": null, "output_dim": 100, "input_dim": 1164}, "class_name": "Dense"}, {"config": {"activation": "elu", "trainable": true, "name": "activation_7"}, "class_name": "Activation"}, {"config": {"trainable": true, "p": 0.5, "name": "dropout_7"}, "class_name": "Dropout"}, {"config": {"activation": "linear", "W_constraint": null, "W_regularizer": null, "bias": true, "name": "dense_3", "b_constraint": null, "trainable": true, "b_regularizer": null, "init": "glorot_uniform", "activity_regularizer": null, "output_dim": 50, "input_dim": 100}, "class_name": "Dense"}, {"config": {"activation": "elu", "trainable": true, "name": "activation_8"}, "class_name": "Activation"}, {"config": {"trainable": true, "p": 0.5, "name": "dropout_8"}, "class_name": "Dropout"}, {"config": {"activation": "linear", "W_constraint": null, "W_regularizer": null, "bias": true, "name": "dense_4", "b_constraint": null, "trainable": true, "b_regularizer": null, "init": "glorot_uniform", "activity_regularizer": null, "output_dim": 10, "input_dim": 50}, "class_name": "Dense"}, {"config": {"activation": "elu", "trainable": true, "name": "activation_9"}, "class_name": "Activation"}, {"config": {"activation": "linear", "W_constraint": null, "W_regularizer": null, "bias": true, "name": "dense_5", "b_constraint": null, "trainable": true, "b_regularizer": null, "init": "glorot_uniform", "activity_regularizer": null, "output_dim": 1, "input_dim": 10}, "class_name": "Dense"}, {"config": {"activation": "linear", "trainable": true, "name": "activation_10"}, "class_name": "Activation"}], "class_name": "Sequential", "keras_version": "1.2.1"}