{"class_name": "Sequential", "keras_version": "1.2.1", "config": [{"class_name": "Lambda", "config": {"function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e9\u007f\u0000\u0000\u0000\u00e9\u0001\u0000\u0000\u0000\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\bmodel.py\u00da\b<lambda>\u0011\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "trainable": true, "name": "lambda_1", "function_type": "lambda", "batch_input_shape": [null, 66, 200, 3], "output_shape": null, "output_shape_type": "raw", "input_dtype": "float32", "arguments": {}}}, {"class_name": "Convolution2D", "config": {"init": "normal", "trainable": true, "b_constraint": null, "W_regularizer": null, "subsample": [2, 2], "nb_col": 5, "nb_filter": 24, "nb_row": 5, "activation": "linear", "name": "convolution2d_1", "bias": true, "border_mode": "valid", "b_regularizer": null, "activity_regularizer": null, "dim_ordering": "tf", "W_constraint": null}}, {"class_name": "Activation", "config": {"activation": "elu", "trainable": true, "name": "activation_1"}}, {"class_name": "Dropout", "config": {"trainable": true, "p": 0.5, "name": "dropout_1"}}, {"class_name": "Convolution2D", "config": {"init": "normal", "trainable": true, "b_constraint": null, "W_regularizer": null, "subsample": [2, 2], "nb_col": 5, "nb_filter": 36, "nb_row": 5, "activation": "linear", "name": "convolution2d_2", "bias": true, "border_mode": "valid", "b_regularizer": null, "activity_regularizer": null, "dim_ordering": "tf", "W_constraint": null}}, {"class_name": "Activation", "config": {"activation": "elu", "trainable": true, "name": "activation_2"}}, {"class_name": "Dropout", "config": {"trainable": true, "p": 0.5, "name": "dropout_2"}}, {"class_name": "Convolution2D", "config": {"init": "normal", "trainable": true, "b_constraint": null, "W_regularizer": null, "subsample": [2, 2], "nb_col": 5, "nb_filter": 48, "nb_row": 5, "activation": "linear", "name": "convolution2d_3", "bias": true, "border_mode": "valid", "b_regularizer": null, "activity_regularizer": null, "dim_ordering": "tf", "W_constraint": null}}, {"class_name": "Activation", "config": {"activation": "elu", "trainable": true, "name": "activation_3"}}, {"class_name": "Dropout", "config": {"trainable": true, "p": 0.5, "name": "dropout_3"}}, {"class_name": "Convolution2D", "config": {"init": "normal", "trainable": true, "b_constraint": null, "W_regularizer": null, "subsample": [1, 1], "nb_col": 3, "nb_filter": 64, "nb_row": 3, "activation": "linear", "name": "convolution2d_4", "bias": true, "border_mode": "valid", "b_regularizer": null, "activity_regularizer": null, "dim_ordering": "tf", "W_constraint": null}}, {"class_name": "Activation", "config": {"activation": "elu", "trainable": true, "name": "activation_4"}}, {"class_name": "Dropout", "config": {"trainable": true, "p": 0.5, "name": "dropout_4"}}, {"class_name": "Convolution2D", "config": {"init": "normal", "trainable": true, "b_constraint": null, "W_regularizer": null, "subsample": [1, 1], "nb_col": 3, "nb_filter": 64, "nb_row": 3, "activation": "linear", "name": "convolution2d_5", "bias": true, "border_mode": "valid", "b_regularizer": null, "activity_regularizer": null, "dim_ordering": "tf", "W_constraint": null}}, {"class_name": "Activation", "config": {"activation": "elu", "trainable": true, "name": "activation_5"}}, {"class_name": "Dropout", "config": {"trainable": true, "p": 0.5, "name": "dropout_5"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"init": "glorot_uniform", "trainable": true, "b_constraint": null, "bias": true, "W_regularizer": null, "activation": "linear", "output_dim": 1164, "W_constraint": null, "input_dim": 1152, "b_regularizer": null, "activity_regularizer": null, "name": "dense_1"}}, {"class_name": "Activation", "config": {"activation": "elu", "trainable": true, "name": "activation_6"}}, {"class_name": "Dropout", "config": {"trainable": true, "p": 0.5, "name": "dropout_6"}}, {"class_name": "Dense", "config": {"init": "glorot_uniform", "trainable": true, "b_constraint": null, "bias": true, "W_regularizer": null, "activation": "linear", "output_dim": 100, "W_constraint": null, "input_dim": 1164, "b_regularizer": null, "activity_regularizer": null, "name": "dense_2"}}, {"class_name": "Activation", "config": {"activation": "elu", "trainable": true, "name": "activation_7"}}, {"class_name": "Dropout", "config": {"trainable": true, "p": 0.5, "name": "dropout_7"}}, {"class_name": "Dense", "config": {"init": "glorot_uniform", "trainable": true, "b_constraint": null, "bias": true, "W_regularizer": null, "activation": "linear", "output_dim": 50, "W_constraint": null, "input_dim": 100, "b_regularizer": null, "activity_regularizer": null, "name": "dense_3"}}, {"class_name": "Activation", "config": {"activation": "elu", "trainable": true, "name": "activation_8"}}, {"class_name": "Dropout", "config": {"trainable": true, "p": 0.5, "name": "dropout_8"}}, {"class_name": "Dense", "config": {"init": "glorot_uniform", "trainable": true, "b_constraint": null, "bias": true, "W_regularizer": null, "activation": "linear", "output_dim": 10, "W_constraint": null, "input_dim": 50, "b_regularizer": null, "activity_regularizer": null, "name": "dense_4"}}, {"class_name": "Activation", "config": {"activation": "elu", "trainable": true, "name": "activation_9"}}, {"class_name": "Dense", "config": {"init": "glorot_uniform", "trainable": true, "b_constraint": null, "bias": true, "W_regularizer": null, "activation": "linear", "output_dim": 1, "W_constraint": null, "input_dim": 10, "b_regularizer": null, "activity_regularizer": null, "name": "dense_5"}}, {"class_name": "Activation", "config": {"activation": "linear", "trainable": true, "name": "activation_10"}}]}