{"config": [{"config": {"function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e9\u007f\u0000\u0000\u0000\u00e9\u0001\u0000\u0000\u0000\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\bmodel.py\u00da\b<lambda>\u0011\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "batch_input_shape": [null, 66, 200, 3], "output_shape_type": "raw", "name": "lambda_1", "arguments": {}, "function_type": "lambda", "trainable": true, "output_shape": null, "input_dtype": "float32"}, "class_name": "Lambda"}, {"config": {"subsample": [2, 2], "W_regularizer": null, "border_mode": "valid", "name": "convolution2d_1", "nb_col": 5, "b_regularizer": null, "trainable": true, "init": "normal", "nb_filter": 24, "dim_ordering": "tf", "nb_row": 5, "activation": "linear", "activity_regularizer": null, "W_constraint": null, "bias": true, "b_constraint": null}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "name": "activation_1", "activation": "elu"}, "class_name": "Activation"}, {"config": {"name": "dropout_1", "trainable": true, "p": 0.5}, "class_name": "Dropout"}, {"config": {"subsample": [2, 2], "W_regularizer": null, "border_mode": "valid", "name": "convolution2d_2", "nb_col": 5, "b_regularizer": null, "trainable": true, "init": "normal", "nb_filter": 36, "dim_ordering": "tf", "nb_row": 5, "activation": "linear", "activity_regularizer": null, "W_constraint": null, "bias": true, "b_constraint": null}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "name": "activation_2", "activation": "elu"}, "class_name": "Activation"}, {"config": {"name": "dropout_2", "trainable": true, "p": 0.5}, "class_name": "Dropout"}, {"config": {"subsample": [2, 2], "W_regularizer": null, "border_mode": "valid", "name": "convolution2d_3", "nb_col": 5, "b_regularizer": null, "trainable": true, "init": "normal", "nb_filter": 48, "dim_ordering": "tf", "nb_row": 5, "activation": "linear", "activity_regularizer": null, "W_constraint": null, "bias": true, "b_constraint": null}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "name": "activation_3", "activation": "elu"}, "class_name": "Activation"}, {"config": {"name": "dropout_3", "trainable": true, "p": 0.5}, "class_name": "Dropout"}, {"config": {"subsample": [1, 1], "W_regularizer": null, "border_mode": "valid", "name": "convolution2d_4", "nb_col": 3, "b_regularizer": null, "trainable": true, "init": "normal", "nb_filter": 64, "dim_ordering": "tf", "nb_row": 3, "activation": "linear", "activity_regularizer": null, "W_constraint": null, "bias": true, "b_constraint": null}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "name": "activation_4", "activation": "elu"}, "class_name": "Activation"}, {"config": {"name": "dropout_4", "trainable": true, "p": 0.5}, "class_name": "Dropout"}, {"config": {"subsample": [1, 1], "W_regularizer": null, "border_mode": "valid", "name": "convolution2d_5", "nb_col": 3, "b_regularizer": null, "trainable": true, "init": "normal", "nb_filter": 64, "dim_ordering": "tf", "nb_row": 3, "activation": "linear", "activity_regularizer": null, "W_constraint": null, "bias": true, "b_constraint": null}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "name": "activation_5", "activation": "elu"}, "class_name": "Activation"}, {"config": {"name": "dropout_5", "trainable": true, "p": 0.5}, "class_name": "Dropout"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"W_regularizer": null, "init": "glorot_uniform", "name": "dense_1", "trainable": true, "output_dim": 1164, "input_dim": 1152, "b_regularizer": null, "activation": "linear", "activity_regularizer": null, "W_constraint": null, "bias": true, "b_constraint": null}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "activation_6", "activation": "elu"}, "class_name": "Activation"}, {"config": {"name": "dropout_6", "trainable": true, "p": 0.5}, "class_name": "Dropout"}, {"config": {"W_regularizer": null, "init": "glorot_uniform", "name": "dense_2", "trainable": true, "output_dim": 100, "input_dim": 1164, "b_regularizer": null, "activation": "linear", "activity_regularizer": null, "W_constraint": null, "bias": true, "b_constraint": null}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "activation_7", "activation": "elu"}, "class_name": "Activation"}, {"config": {"name": "dropout_7", "trainable": true, "p": 0.5}, "class_name": "Dropout"}, {"config": {"W_regularizer": null, "init": "glorot_uniform", "name": "dense_3", "trainable": true, "output_dim": 50, "input_dim": 100, "b_regularizer": null, "activation": "linear", "activity_regularizer": null, "W_constraint": null, "bias": true, "b_constraint": null}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "activation_8", "activation": "elu"}, "class_name": "Activation"}, {"config": {"name": "dropout_8", "trainable": true, "p": 0.5}, "class_name": "Dropout"}, {"config": {"W_regularizer": null, "init": "glorot_uniform", "name": "dense_4", "trainable": true, "output_dim": 10, "input_dim": 50, "b_regularizer": null, "activation": "linear", "activity_regularizer": null, "W_constraint": null, "bias": true, "b_constraint": null}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "activation_9", "activation": "elu"}, "class_name": "Activation"}, {"config": {"W_regularizer": null, "init": "glorot_uniform", "name": "dense_5", "trainable": true, "output_dim": 1, "input_dim": 10, "b_regularizer": null, "activation": "linear", "activity_regularizer": null, "W_constraint": null, "bias": true, "b_constraint": null}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "activation_10", "activation": "linear"}, "class_name": "Activation"}], "class_name": "Sequential", "keras_version": "1.2.1"}