{"class_name": "Sequential", "config": [{"class_name": "Lambda", "config": {"function_type": "lambda", "name": "lambda_1", "input_dtype": "float32", "batch_input_shape": [null, 66, 200, 3], "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e9\u007f\u0000\u0000\u0000\u00e9\u0001\u0000\u0000\u0000\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\bmodel.py\u00da\b<lambda>\u0011\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "output_shape_type": "raw", "arguments": {}, "trainable": true, "output_shape": null}}, {"class_name": "Convolution2D", "config": {"dim_ordering": "tf", "border_mode": "valid", "name": "convolution2d_1", "b_regularizer": null, "bias": true, "nb_filter": 24, "nb_col": 5, "activation": "linear", "W_regularizer": null, "b_constraint": null, "nb_row": 5, "init": "normal", "W_constraint": null, "activity_regularizer": null, "trainable": true, "subsample": [2, 2]}}, {"class_name": "Activation", "config": {"activation": "elu", "name": "activation_1", "trainable": true}}, {"class_name": "Dropout", "config": {"p": 0.5, "name": "dropout_1", "trainable": true}}, {"class_name": "Convolution2D", "config": {"dim_ordering": "tf", "border_mode": "valid", "name": "convolution2d_2", "b_regularizer": null, "bias": true, "nb_filter": 36, "nb_col": 5, "activation": "linear", "W_regularizer": null, "b_constraint": null, "nb_row": 5, "init": "normal", "W_constraint": null, "activity_regularizer": null, "trainable": true, "subsample": [2, 2]}}, {"class_name": "Activation", "config": {"activation": "elu", "name": "activation_2", "trainable": true}}, {"class_name": "Dropout", "config": {"p": 0.5, "name": "dropout_2", "trainable": true}}, {"class_name": "Convolution2D", "config": {"dim_ordering": "tf", "border_mode": "valid", "name": "convolution2d_3", "b_regularizer": null, "bias": true, "nb_filter": 48, "nb_col": 5, "activation": "linear", "W_regularizer": null, "b_constraint": null, "nb_row": 5, "init": "normal", "W_constraint": null, "activity_regularizer": null, "trainable": true, "subsample": [2, 2]}}, {"class_name": "Activation", "config": {"activation": "elu", "name": "activation_3", "trainable": true}}, {"class_name": "Dropout", "config": {"p": 0.5, "name": "dropout_3", "trainable": true}}, {"class_name": "Convolution2D", "config": {"dim_ordering": "tf", "border_mode": "valid", "name": "convolution2d_4", "b_regularizer": null, "bias": true, "nb_filter": 64, "nb_col": 3, "activation": "linear", "W_regularizer": null, "b_constraint": null, "nb_row": 3, "init": "normal", "W_constraint": null, "activity_regularizer": null, "trainable": true, "subsample": [1, 1]}}, {"class_name": "Activation", "config": {"activation": "elu", "name": "activation_4", "trainable": true}}, {"class_name": "Dropout", "config": {"p": 0.5, "name": "dropout_4", "trainable": true}}, {"class_name": "Convolution2D", "config": {"dim_ordering": "tf", "border_mode": "valid", "name": "convolution2d_5", "b_regularizer": null, "bias": true, "nb_filter": 64, "nb_col": 3, "activation": "linear", "W_regularizer": null, "b_constraint": null, "nb_row": 3, "init": "normal", "W_constraint": null, "activity_regularizer": null, "trainable": true, "subsample": [1, 1]}}, {"class_name": "Activation", "config": {"activation": "elu", "name": "activation_5", "trainable": true}}, {"class_name": "Dropout", "config": {"p": 0.5, "name": "dropout_5", "trainable": true}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"name": "dense_1", "b_regularizer": null, "bias": true, "input_dim": 1152, "activation": "linear", "W_regularizer": null, "b_constraint": null, "activity_regularizer": null, "W_constraint": null, "output_dim": 1164, "trainable": true, "init": "glorot_uniform"}}, {"class_name": "Activation", "config": {"activation": "elu", "name": "activation_6", "trainable": true}}, {"class_name": "Dropout", "config": {"p": 0.5, "name": "dropout_6", "trainable": true}}, {"class_name": "Dense", "config": {"name": "dense_2", "b_regularizer": null, "bias": true, "input_dim": 1164, "activation": "linear", "W_regularizer": null, "b_constraint": null, "activity_regularizer": null, "W_constraint": null, "output_dim": 100, "trainable": true, "init": "glorot_uniform"}}, {"class_name": "Activation", "config": {"activation": "elu", "name": "activation_7", "trainable": true}}, {"class_name": "Dropout", "config": {"p": 0.5, "name": "dropout_7", "trainable": true}}, {"class_name": "Dense", "config": {"name": "dense_3", "b_regularizer": null, "bias": true, "input_dim": 100, "activation": "linear", "W_regularizer": null, "b_constraint": null, "activity_regularizer": null, "W_constraint": null, "output_dim": 50, "trainable": true, "init": "glorot_uniform"}}, {"class_name": "Activation", "config": {"activation": "elu", "name": "activation_8", "trainable": true}}, {"class_name": "Dropout", "config": {"p": 0.5, "name": "dropout_8", "trainable": true}}, {"class_name": "Dense", "config": {"name": "dense_4", "b_regularizer": null, "bias": true, "input_dim": 50, "activation": "linear", "W_regularizer": null, "b_constraint": null, "activity_regularizer": null, "W_constraint": null, "output_dim": 10, "trainable": true, "init": "glorot_uniform"}}, {"class_name": "Activation", "config": {"activation": "elu", "name": "activation_9", "trainable": true}}, {"class_name": "Dense", "config": {"name": "dense_5", "b_regularizer": null, "bias": true, "input_dim": 10, "activation": "linear", "W_regularizer": null, "b_constraint": null, "activity_regularizer": null, "W_constraint": null, "output_dim": 1, "trainable": true, "init": "glorot_uniform"}}, {"class_name": "Activation", "config": {"activation": "linear", "name": "activation_10", "trainable": true}}], "keras_version": "1.2.1"}